package com.rox.tools.film.excel;

import java.text.SimpleDateFormat;
import java.util.*;

/**
 * Created by Rox on 2017/7/3.
 */
public class FileCompare {
    public static void main(String[] args) {
        //compare();

        sort();
    }

    protected static void compare() {
        Map<String, String> cache = initSource();

        Calendar c = Calendar.getInstance();
        c.set(2014, 5, 6);
        SimpleDateFormat format = new SimpleDateFormat("yyyyMMdd");
        for(int i = 0; i < 200; i++) {
            String date = format.format(c.getTime());
            String film = cache.get(date);

            System.out.printf("%s\t%s\n", date, film);
            c.add(Calendar.DAY_OF_MONTH, 7);
        }
    }
    protected static Map<String, String> initSource() {
        Map<String, String> cache = new HashMap<>();
        cache.put("20170120", "晓松奇谈之世界很小 后会有期");
        cache.put("20170113", "晓松奇谈之匠心依旧");
        cache.put("20170106", "晓松奇谈之战士不死");
        cache.put("20161230", "晓松奇谈之不说再见");
        cache.put("20161223", "晓松奇谈之CIA暗杀笔记");
        cache.put("20161216", "晓松奇谈之卡斯特罗与切·格瓦拉");
        cache.put("20161209", "晓松奇谈之卡斯特罗正传");
        cache.put("20161202", "晓松奇谈之揭秘日本道文化 看摇滚巨匠沙漠之旅");
        cache.put("20161125", "晓松奇谈之匠心之旅：迷失京都");
        cache.put("20161118", "晓松奇谈之匠心之旅：日本料理PK中华美食");
        cache.put("20161111", "晓松奇谈之反思美国大选");
        cache.put("20161104", "晓松奇谈之高晓松探访星战圣地天行者庄园 下");
        cache.put("20161028", "晓松奇谈之高晓松探访星战圣地天行者庄园 上");
        cache.put("20161021", "晓松奇谈之高晓松谈文青的一周 同台飚戏金城武");
        cache.put("20161014", "晓松奇谈之波罗的海的奋斗");
        cache.put("20161007", "晓松奇谈之国际纵队 永别了武器");
        cache.put("20160930", "晓松奇谈之揭秘国际纵队 海明威竟陷身性绯闻");
        cache.put("20160923", "晓松奇谈之校园民谣熟悉的恋恋风尘");
        cache.put("20160916", "晓松奇谈之扒一扒加拿大4： 白宫陷落");
        cache.put("20160909", "晓松奇谈之扒一扒加拿大3： 文艺之都蒙特利尔");
        cache.put("20160902", "晓松奇谈之扒一扒加拿大2：原住民酋长");
        cache.put("20160819", "晓松奇谈之扒一扒加拿大1：来了，温哥华?");
        cache.put("20160812", "晓松奇谈之扒一扒北欧：当童话照进现实");
        cache.put("20160805", "晓松奇谈之扒一扒北欧：瑞典女王?");
        cache.put("20160729", "晓松奇谈之扒一扒北欧：安徒生与维京海盗");
        cache.put("20160722", "晓松奇谈之睡在上铺的兄弟：海子?");
        cache.put("20160715", "晓松奇谈之一个国家的诞生：伪装者");
        cache.put("20160708", "晓松奇谈之口述历史：北戴河秘闻");
        cache.put("20160701", "晓松奇谈之口述历史：周恩来解放后密会蒋经国");
        cache.put("20160624", "晓松奇谈之口述历史之对谈张治中女儿");
        cache.put("20160617", "晓松奇谈之好莱坞精英：犹太大亨vs中国大款");
        cache.put("20160610", "晓松奇谈之好莱坞精英：恶棍天使");
        cache.put("20160603", "晓松奇谈之唱片时代与美国大选");
        cache.put("20160527", "晓松奇谈之谁越过了三八线 ???");
        cache.put("20160520", "晓松奇谈之不成熟小建议之三个首次回应的问题");
        cache.put("20160513", "晓松奇谈之谁是白眼狼");
        cache.put("20160506", "晓松奇谈之扒一扒韩国：大长今");
        cache.put("20160429", "晓松奇谈之扒一扒韩国：请回答2016");
        cache.put("20160415", "晓松奇谈之扒一扒韩国：继承者们");
        cache.put("20160408", "晓松奇谈之扒一扒韩国：太阳的后裔");
        cache.put("20160401", "晓松奇谈之1860年代：太平天国与南北战争(下)");
        cache.put("20160325", "晓松奇谈之1860年代：太平天国与南北战争(上)");
        cache.put("20160318", "晓松奇谈之张学良：西安事变（下）");
        cache.put("20160311", "晓松奇谈之张学良：西安事变（上）");
        cache.put("20160304", "晓松奇谈之张学良（二）九一八真相??");
        cache.put("20160226", "晓松奇谈之2016颁奖季：格莱美与奥斯卡");
        cache.put("20160219", "晓松奇谈之张学良（一）风流少帅");
        cache.put("20160212", "晓松奇谈之2016说说心里话");
        cache.put("20160205", "晓松奇谈之清明上河图（下）");
        cache.put("20160129", "晓松奇谈之清明上河图（上）");
        cache.put("20160122", "晓松奇谈之大众记忆（下）：摇滚老炮儿");
        cache.put("20160115", "晓松奇谈之大众记忆（上）：北京老炮儿");
        cache.put("20160108", "晓松奇谈之扒一扒以色列下：共产主义实现之后");
        cache.put("20160101", "晓松奇谈之扒一扒以色列（上）盗墓笔记");
        cache.put("20151225", "晓松奇谈之1860年代：维多利亚的秘密");
        cache.put("20151218", "晓松奇谈之1860年代：欧洲残酷扩张");
        cache.put("20151211", "晓松奇谈之1860年代：高潮来临");
        cache.put("20151204", "晓松奇谈之代号大富翁");
        cache.put("20151127", "晓松奇谈之美国生活成本报告");
        cache.put("20151120", "晓松奇谈之ISIS肆虐与中国出兵护侨");
        cache.put("20151113", "晓松奇谈之北洋拾遗（上）：天价赔款收回之迷");
        cache.put("20151106", "晓松奇谈之张勋和他的北洋(4)复辟正确打开方式");
        cache.put("20151030", "晓松奇谈之张勋和他的北洋（3）被忽悠的冤大头");
        cache.put("20151023", "晓松奇谈之女王的骑士团");
        cache.put("20151016", "晓松奇谈之马与美国大选");
        cache.put("20151009", "晓松奇谈之TPP和欧洲难民危机");
        cache.put("20151002", "晓松奇谈之张勋和他的北洋2：权力的游戏");
        cache.put("20150925", "晓松奇谈之张勋和他的北洋1：草莽时代的小咖秀");
        cache.put("20150918", "晓松奇谈之大电影·看历史2：阿甘正传（下）");
        cache.put("20150911", "晓松奇谈之大电影·看历史1：阿甘正传（上）");
        cache.put("20150904", "晓松奇谈之两个抓紧时间看的问题");
        cache.put("20150828", "晓松奇谈之扒一扒美利坚10 西雅图特产垄断寡头");
        cache.put("20150821", "晓松奇谈之黄金大劫案");
        cache.put("20150814", "晓松奇谈之三个令人发指的问题");
        cache.put("20150807", "晓松奇谈之扒一扒美利坚9——种族歧视蝴蝶效应");
        cache.put("20150731", "晓松奇谈之扒一扒美利坚8——成人的童话乐园");
        cache.put("20150724", "晓松奇谈之禅让与革命3——纯种汉人去哪儿了");
        cache.put("20150717", "晓松奇谈之禅让与革命2—罗马皇帝禅位同性恋人");
        cache.put("20150710", "晓松奇谈之禅让与革命1——华夏第一帝国");
        cache.put("20150703", "晓松奇谈之扒一扒美利坚7—南部顽固对抗同性恋");
        cache.put("20150626", "晓松奇谈之扒一扒美利坚6——拿破仑与小龙虾");
        cache.put("20150619", "晓松奇谈之扒一扒美利坚5——民意绑架死刑");
        cache.put("20150612", "晓松奇谈之扒一扒美利坚4——枪与堕胎药");
        cache.put("20150522", "晓松奇谈之扒一扒美利坚3 赌城风云");
        cache.put("20150508", "晓松奇谈之胜利阴影下（3）失贞与叛国");
        cache.put("20150501", "晓松奇谈之胜利阴影下2高帅富征服德意日女性");
        cache.put("20150424", "晓松奇谈之胜利阴影下（1）解密七百里战俘营");
        cache.put("20150417", "晓松奇谈之扒一扒美利坚2—假乳房与橘子（下）");
        cache.put("20150410", "晓松奇谈之扒一扒美利坚1—假乳房与橘子（上）");
        cache.put("20150403", "晓松奇谈之乱世佳人（下）作女、腐女、励志女");
        cache.put("20150320", "晓松奇谈之乱世佳人（上） 国民女神们终嫁何人");
        cache.put("20150313", "晓松奇谈之妄人列传下 揭秘屠杀人口最多的朝代");
        cache.put("20150306", "晓松奇谈之妄人列传马可·波罗（上）");
        cache.put("20150227", "晓松奇谈之朝花夕拾（下）");
        cache.put("20150220", "晓松奇谈之奇谈奇葩大拜年 贺岁集锦");
        cache.put("20150213", "晓松奇谈之朝花夕拾（中）");
        cache.put("20150206", "晓松奇谈之朝花夕拾（上）");
        cache.put("20141024", "晓松奇谈之致白衣飘飘的年代");
        cache.put("20141017", "晓松奇谈之梦露之死与共济会(下)");
        cache.put("20141010", "晓松奇谈之梦露之死与共济会(中)");
        cache.put("20141003", "晓松奇谈之梦露之死与共济会(上)");
        cache.put("20140926", "晓松奇谈之一战1913（下） 敢爱故事之文艺时代");
        cache.put("20140919", "晓松奇谈之一战1913（上）敢爱故事之伟大时代");
        cache.put("20140912", "晓松奇谈之澳大利亚（下）");
        cache.put("20140905", "晓松奇谈之澳大利亚（上）");
        cache.put("20140829", "晓松奇谈之南明悲歌（六）南明大结局");
        cache.put("20140822", "晓松奇谈之南明悲歌（五）真假太子案");
        cache.put("20140815", "晓松奇谈之南明悲歌（四）名妓与名士");
        cache.put("20140808", "晓松奇谈之南明悲歌（三） 江南大屠杀");
        cache.put("20140801", "晓松奇谈之南明悲歌（二） 爱国与卖国");
        cache.put("20140725", "晓松奇谈之南明悲歌（一）臭知识分子亡国");
        cache.put("20140718", "晓松奇谈之金砖老二 巴西");
        cache.put("20140711", "晓松奇谈之世界杯之挥霍天赋的巴西人");
        cache.put("20140704", "晓松奇谈之世界杯之夜闯巴西贫民窟");
        cache.put("20140627", "晓松奇谈之世界杯之拉美自相残杀");
        cache.put("20140620", "晓松奇谈之世界杯之西班牙折戟拉美");
        cache.put("20140613", "晓松奇谈之“旗”妙物语世界杯二 黑非洲殖民泪");
        cache.put("20140606", "晓松奇谈之“旗”妙物语世界杯一 欧罗巴余晖");

        return cache;
    }

    public static void sort() {
        List list = new ArrayList(52);

        list.add("晓松奇谈20140606.ts");
        list.add("晓松奇谈20140613.ts");
        list.add("晓松奇谈20140620.ts");
        list.add("晓松奇谈20140627.ts");
        list.add("晓松奇谈20140704.ts");
        list.add("晓松奇谈20140711.ts");
        list.add("晓松奇谈20140718.ts");
        list.add("晓松奇谈20140724.ts");
        list.add("晓松奇谈20140801.ts");
        list.add("晓松奇谈20140808.ts");
        list.add("晓松奇谈20140815.ts");
        list.add("晓松奇谈20140822.ts");
        list.add("晓松奇谈20140829.ts");
        list.add("晓松奇谈20140905.ts");
        list.add("晓松奇谈20140912.ts");
        list.add("晓松奇谈20140919.ts");
        list.add("晓松奇谈20140926.ts");
        list.add("晓松奇谈20141003.ts");
        list.add("晓松奇谈20141010.ts");
        list.add("晓松奇谈20141017.ts");
        list.add("晓松奇谈20141024.ts");
        list.add("晓松奇谈20141031.ts");
        list.add("晓松奇谈20141107.ts");
        list.add("晓松奇谈20141114.ts");
        list.add("晓松奇谈20141121.ts");
        list.add("晓松奇谈20141128.ts");
        list.add("晓松奇谈20141205.ts");
        list.add("晓松奇谈20141212.ts");
        list.add("晓松奇谈20141219.ts");
        list.add("晓松奇谈20141226.ts");
        out(list, "2014");

        list.clear();
        list.add("晓松奇谈20150102.ts");
        list.add("晓松奇谈20150109.ts");
        list.add("晓松奇谈20150116.ts");
        list.add("晓松奇谈20150123.ts");
        list.add("晓松奇谈20150130.ts");
        list.add("晓松奇谈20150206.ts");
        list.add("晓松奇谈20150213.ts");
        list.add("晓松奇谈20150220.ts");
        list.add("晓松奇谈20150227.ts");
        list.add("晓松奇谈20150306.ts");
        list.add("晓松奇谈20150313.ts");
        list.add("晓松奇谈20150320.ts");
        list.add("晓松奇谈20150403.ts");
        list.add("晓松奇谈20150410.ts");
        list.add("晓松奇谈20150417.ts");
        list.add("晓松奇谈20150424.ts");
        list.add("晓松奇谈20150501.ts");
        list.add("晓松奇谈20150508.ts");
        list.add("晓松奇谈20150515.ts");
        list.add("晓松奇谈20150522.ts");
        list.add("晓松奇谈20150529.ts");
        list.add("晓松奇谈20150605.ts");
        list.add("晓松奇谈20150612.ts");
        list.add("晓松奇谈20150619.ts");
        list.add("晓松奇谈20150626.ts");
        list.add("晓松奇谈20150703.ts");
        list.add("晓松奇谈20150710.ts");
        list.add("晓松奇谈20150717.ts");
        list.add("晓松奇谈20150724.ts");
        list.add("晓松奇谈20150731.ts");
        list.add("晓松奇谈20150807.ts");
        list.add("晓松奇谈20150814.ts");
        list.add("晓松奇谈20150821.ts");
        list.add("晓松奇谈20150828.ts");
        list.add("晓松奇谈20150904.ts");
        list.add("晓松奇谈20150911.ts");
        list.add("晓松奇谈20150918.ts");
        list.add("晓松奇谈20150925.ts");
        list.add("晓松奇谈20151002.ts");
        list.add("晓松奇谈20151009.ts");
        list.add("晓松奇谈20151016.ts");
        list.add("晓松奇谈20151023.ts");
        list.add("晓松奇谈20151030.ts");
        list.add("晓松奇谈20151106.ts");
        list.add("晓松奇谈20151113.ts");
        list.add("晓松奇谈20151120.ts");
        list.add("晓松奇谈20151127.ts");
        list.add("晓松奇谈20151204.ts");
        list.add("晓松奇谈20151211.ts");
        list.add("晓松奇谈20151218.ts");
        list.add("晓松奇谈20151225.ts");
        out(list, "2015");

        list.clear();
        list.add("晓松奇谈20160101.ts");
        list.add("晓松奇谈20160108.ts");
        list.add("晓松奇谈20160115.ts");
        list.add("晓松奇谈20160122.ts");
        list.add("晓松奇谈20160129.ts");
        list.add("晓松奇谈20160205.ts");
        list.add("晓松奇谈20160212.ts");
        list.add("晓松奇谈20160219.ts");
        list.add("晓松奇谈20160226.ts");
        list.add("晓松奇谈20160304.ts");
        list.add("晓松奇谈20160311.ts");
        list.add("晓松奇谈20160318.ts");
        list.add("晓松奇谈20160325.ts");
        list.add("晓松奇谈20160401.ts");
        list.add("晓松奇谈20160408.ts");
        list.add("晓松奇谈20160415.ts");
        list.add("晓松奇谈20160422.ts");
        list.add("晓松奇谈20160429.ts");
        list.add("晓松奇谈20160506.ts");
        list.add("晓松奇谈20160513.ts");
        list.add("晓松奇谈20160520.ts");
        list.add("晓松奇谈20160527.ts");
        list.add("晓松奇谈20160603.ts");
        list.add("晓松奇谈20160610.ts");
        list.add("晓松奇谈20160617.ts");
        list.add("晓松奇谈20160624.ts");
        list.add("晓松奇谈20160701.ts");
        list.add("晓松奇谈20160708.ts");
        list.add("晓松奇谈20160715.ts");
        list.add("晓松奇谈20160722.ts");
        list.add("晓松奇谈20160729.ts");
        list.add("晓松奇谈20160805.ts");
        list.add("晓松奇谈20160812.ts");
        list.add("晓松奇谈20160819.ts");
        list.add("晓松奇谈20160902.ts");
        list.add("晓松奇谈20160909.ts");
        list.add("晓松奇谈20160916.ts");
        list.add("晓松奇谈20160923.ts");
        list.add("晓松奇谈20160930.ts");
        list.add("晓松奇谈20161007.ts");
        list.add("晓松奇谈20161014.ts");
        list.add("晓松奇谈20161021.ts");
        list.add("晓松奇谈20161028.ts");
        list.add("晓松奇谈20161104.ts");
        list.add("晓松奇谈20161111.ts");
        list.add("晓松奇谈20161118.ts");
        list.add("晓松奇谈20161125.ts");
        list.add("晓松奇谈20161202.ts");
        list.add("晓松奇谈20161209.ts");
        list.add("晓松奇谈20161216.ts");
        list.add("晓松奇谈20161223.ts");
        list.add("晓松奇谈20161230.ts");
        out(list, "2016");

        list.clear();
        list.add("晓松奇谈20170106.ts");
        list.add("晓松奇谈20170113.ts");
        list.add("晓松奇谈20170120.ts");
        out(list, "2017");
    }

    protected static void out(List<String> list, String prefix) {
        for(int i = 0; i < list.size(); i++) {
            System.out.printf("rename %s 晓松奇谈%s第%d期.ts\n", list.get(i), prefix, (i+1));
        }
    }
}
